Revit 2024 API
FabricationConfiguration.GetMaterialByGUID Method
 Gets the material identifier by its GUID.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public int GetMaterialByGUID(
	Guid materialGUID
)
Visual Basic
Public Function GetMaterialByGUID ( _
	materialGUID As Guid _
) As Integer
Visual C++
public:
int GetMaterialByGUID(
	Guid materialGUID
)
Parameters
materialGUID
Type: System.Guid
 The material GUID.
Return Value
 The material identifier. Returns 0 if not found.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace